Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports class imports all native functions related to toleration.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DrawSnapSymbol(Tekla.Structures.Internal.dotPoint_t,System.Int32)
Exports the draw snap symbol command.
point: The point.
hitType: The type of the hit.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.SetInteractorType(System.Int32)
Exports the setting of the interactor type command.
interactorType: The interactor type to set.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetSnappingReferencePoint
Gets the snapping reference point, if any.
Returns: The snapping reference point, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.SetSnappingReferencePoint(Tekla.Structures.Internal.dotPoint_t)
Sets the reference point for the future snapping operations.
point: The point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.ClearSnappingReferencePoint
Clears the reference point for the future snapping operations.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.AddPickedPointToCommandContext(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Adds the picked point into the current command's context.
point: The picked point.
isReferencePoint: A value indicating whether the point is only a reference point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.ClearCommandContextPickedPoints
Clears the picked points in the current command's context.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetSnapStep(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,System.Double@,System.Double@)
Exports the get snap step function.
cursorPoint: The cursor point.
tolerationEventData: The mouse event data struct.
isRebarSnap: Indicates if snapping is related to rebars.
outLinearSnapStep: The linear snap step.
outAngularSnapStep: The angular snap step.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get toleration data command.
tolerationEventData: The toleration event data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetHandleTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get handle toleration data command.
tolerationEventData: The handle toleration event data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetHandleCursorData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t@)
Exports the get handle cursor data command.
cursorEventData: The cursor event.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.ConsumeTolerationEvent
Notifies when the TolerationDataChanged event has been consumed.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.RegisterToleration(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t)
Exports the register toleration command.
tolerationTypes: The toleration types.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.SetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t)
Sets the numeric snap values based on the point.
point: The point.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t@)
Gets the numeric snap values.
point: The numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.ResetNumericSnapValues
Resets the numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.GetOrthoStatus(System.Int32@)
Exports the get ortho status.
status: The status.
Returns:
Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.SetOrtho(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Sets the orthogonal snap switch.
isEnabled: A value indicating whether to enable the orthogonal snap switch.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportDrawSnapSymbol(Tekla.Structures.Internal.dotPoint_t@,System.Int32)
Exports the draw snap symbol command.
point: The point.
hitType: The type of the hit.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportSetInteractorType(System.Int32@)
Exports the set interactor type command.
interactorType: The interactor type to set.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetSnappingReferencePoint(Tekla.Structures.Internal.dotPoint_t@)
Gets the snapping reference point, if any.
point: The struct containing the reference point data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportSetSnappingReferencePoint(Tekla.Structures.Internal.dotPoint_t@)
Sets the reference point for the future snapping operations.
point: The point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportClearSnappingReferencePoint
Clears the reference point for the future snapping operations.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetSnapStep(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@,System.Double@,System.Double@)
Exports the get snap step function.
cursorPoint: The cursor point.
tolerationEventData: The mouse event data struct.
isRebarSnap: Indicates if snapping is related to rebars.
outLinearSnapStep: The linear snap step.
outAngularSnapStep: The angular snap step.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get toleration data command.
tolerationEventData: The toleration event data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetHandleCursorData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t@)
Exports the get handle cursor data command.
cursorEvent: The cursor event.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetHandleTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get handle toleration data command.
tolerationEvent: The toleration event.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportConsumeTolerationEvent
Notifies when the TolerationDataChanged event has been consumed.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportRegisterToleration(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t@)
Exports the register toleration command.
tolerationTypes: The toleration types.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportAddPickedPointToCommandContext(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool@)
Exports the reference point to be added into the current command's context.
point: The current picked point as the reference point.
isReferencePoint: A value indicating whether the point is only a reference point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportClearCommandContextPickedPoints
Notifies to clear the cursor picked points.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportSetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t)
Sets the numeric snap values based on the point.
point: The point.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t@)
Gets the numeric snap values.
point: The numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportResetNumericSnapValues
Resets the numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportGetOrtho(System.Int32@)
Exports the get ortho status.
status: The status.
Returns:
Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.TolerationHandlerImports.DotExportSetOrtho(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Sets the orthogonal snap switch.
isEnabled: A value indicating whether to enable the orthogonal snap switch.